Autodesk.Revit.DB.DialogOptions.NameDialogOptions.SetProhibitedNames(System.Collections.Generic.IList{System.String})
setProhibitedNames
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.DialogOptions.NameDialogOptions.GetProhibitedNames
getProhibitedNames
Since:
2027

Autodesk.Revit.DB.DialogOptions.NameDialogOptions.CharFilter
Since:
2027

Autodesk.Revit.DB.DialogOptions.NameDialogOptions.Name
Since:
2027

Autodesk.Revit.DB.DialogOptions.NameDialogOptions.#ctor(System.UInt32,System.String,Autodesk.Revit.DB.StringUtil.CharFilter)
constructor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.DialogOptions.NameDialogOptions
The specific class for Name dialog options as the input for ManagedCallEventArgs.
Since:
2027